// task3_2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//Задание 2
//«for_each»
//Реализовать параллельный вариант оператора for_each.
//Функция должна принимать итераторы на начало и конец контейнера и ссылку обрабатывающую функцию.
//При реализации необходимо рекурсивно разделить контейнер на несколько блоков и
//для каждого блока запустить отдельную задачу, применяющую обрабатывающую функцию к части контейнера.
#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}
